Reports/ОтчетПоЦенамНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчетПоЦенамНаТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТолькоСОстатком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЦена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочнаяЦена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка35</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка36</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка37</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка38</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецЦена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АДУрал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уцененные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОтчетПоЦенамНаТовары/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    Настройки = КомпоновщикНастроек.Настройки; 
	
    ПараметрСКДТолькоСОстатком = Настройки.ПараметрыДанных.Элементы.Найти("ТолькоСОстатком");
    ПараметрСКДТолькоСОстатком.Значение = ЭтотОбъект.ТолькоСОстатком;
    ПараметрСКДТолькоСОстатком.Использование = Истина;
	
	СписокТиповЦен = Новый СписокЗначений; 
	Если ЭтотОбъект.БазоваяЦена Тогда СписокТиповЦен.Добавить(Константы.БазоваяЦена.Получить()); КонецЕсли;
	Если ЭтотОбъект.ЗакупочнаяЦена Тогда СписокТиповЦен.Добавить(Константы.ЗакупочнаяЦена.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка35 Тогда СписокТиповЦен.Добавить(Константы.Скидка35.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка36 Тогда СписокТиповЦен.Добавить(Константы.Скидка36.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка37 Тогда СписокТиповЦен.Добавить(Константы.Скидка37.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка38 Тогда СписокТиповЦен.Добавить(Константы.Скидка38.Получить()); КонецЕсли;
	Если ЭтотОбъект.СпецЦена Тогда СписокТиповЦен.Добавить(Константы.СпецЦена.Получить()); КонецЕсли;
	Если ЭтотОбъект.АДУрал Тогда СписокТиповЦен.Добавить(Константы.АДУрал.Получить()); КонецЕсли;
	Если ЭтотОбъект.Акция Тогда СписокТиповЦен.Добавить(Константы.Акция.Получить()); КонецЕсли;
	Если ЭтотОбъект.Уцененные Тогда СписокТиповЦен.Добавить(Константы.Уцененные.Получить()); КонецЕсли;
	Если ЭтотОбъект.Резерв4 Тогда СписокТиповЦен.Добавить(Константы.Резерв4.Получить()); КонецЕсли;
	Если ЭтотОбъект.ЦенаСебестоимость Тогда СписокТиповЦен.Добавить(Константы.ЦенаСебестоимость.Получить()); КонецЕсли;

	ПараметрСКДТипЦен = Настройки.ПараметрыДанных.Элементы.Найти("ТипЦен");
	ПараметрСКДТипЦен.Значение = СписокТиповЦен;
	ПараметрСКДТипЦен.Использование = Истина;
КонецПроцедуры
